The restapi provider has changed. Two points to notice:

On first apply with 2.0.1 the output shows:

```
  # module.set_quota.restapi_object.container_registry_traffic_quota[0] will be created
  + resource "restapi_object" "container_registry_traffic_quota" {
      + api_data                  = (known after apply)
      + api_response              = (known after apply)
      + create_method             = "PATCH"
      + create_path               = "//us.icr.io/api/v1/quotas"
      + create_response           = (known after apply)
      + data                      = jsonencode(
            {
              + traffic_megabytes = 499
            }
        )
      + destroy_data              = jsonencode(
            {
              + traffic_megabytes = 5120
            }
        )
      + destroy_method            = "PATCH"
      + destroy_path              = "//us.icr.io/api/v1/quotas"
      + id                        = (known after apply)
      + ignore_all_server_changes = false
      + object_id                 = "traffic"
      + path                      = "//us.icr.io/api/v1/quotas"
      + read_method               = "GET"
      + read_path                 = "//us.icr.io/api/v1/quotas"
      + update_method             = "PATCH"
      + update_path               = "//us.icr.io/api/v1/quotas"
    }

  # module.set_quota.restapi_object.container_registry_traffic_quota[0] will be updated in-place
  ~ resource "restapi_object" "container_registry_traffic_quota" {
      ~ data                      = jsonencode(
          ~ {
              - limit             = {
                  - storage_bytes = 5367660544
                  - store         = 5367660544
                  - traffic       = 523239424
                  - traffic_bytes = 523239424
                }
              ~ traffic_megabytes = null -> 499
              - usage             = {
                  - storage_bytes = 55568282
                  - store         = 55568282
                  - traffic       = 0
                }
            }
        )
        id                        = "traffic"
        # (15 unchanged attributes hidden)
    }
```

With 1.20.0 this showed as a new resource:

```
  # module.set_quota.restapi_object.container_registry_traffic_quota[0] will be created
  + resource "restapi_object" "container_registry_traffic_quota" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_method   = "PATCH"
      + create_path     = "//us.icr.io/api/v1/quotas"
      + create_response = (known after apply)
      + data            = jsonencode(
            {
              + traffic_megabytes = 499
            }
        )
      + destroy_data    = jsonencode(
            {
              + traffic_megabytes = 5120
            }
        )
      + destroy_method  = "PATCH"
      + destroy_path    = "//us.icr.io/api/v1/quotas"
      + id              = (known after apply)
      + object_id       = "traffic"
      + path            = "//us.icr.io/api/v1/quotas"
      + read_method     = "GET"
      + read_path       = "//us.icr.io/api/v1/quotas"
      + update_method   = "PATCH"
      + update_path     = "//us.icr.io/api/v1/quotas"
    }
    
Subsequent apply:

No changes. Your infrastructure matches the configuration.
```

The underlying issue appears to be that the inputs are not reflected in the outputs. The data block passes traffic_megabytes, but this is not returned, instead an a general limits block with byte specific data is set. 
data { traffic_megabytes } becomes data { limit { traffic, traffic_bytes, storage, storage_bytes }} so on a plan/apply for consistency the megabytes is being set again and the limit is being removed. This causes the idempotent validation to fail.

Note: This update in place will be seen on every plan/apply since the value is never set.